## Some Handi Jupyter shortcuts

Shift + enter : To run and move to next cell.

ctrl + enter : To run current cell.

Tab :  To autocomplete.

Shift + tab : To see documentation.

# Get data from multiple resource

In [9]:
import requests as req
import pandas as pd

### Get data from files

In [5]:
# To read excel
exldf = pd.read_excel("someexcel.xlsx", sheet_name = "mysheet")

# To read csv
csvdf = pd.read_csv("dict_without_index.csv")

In [7]:
exldf.head(2)

          B         D         E
0  0.649527  0.809788  0.280809
1  0.961442  0.716929  0.885945

In [8]:
csvdf.head(3)

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80

### Get Data from API to dataframe

In [32]:
response = req.get("https://jsonplaceholder.typicode.com/comments", params = { 'postId' : '1' })
jsondata = response.json()
df = pd.DataFrame(jsondata)
df

,postId,id,name,email,body
0,1,1,id labore ex et quam laborum,Eliseo@gardner.biz,laudantium enim quasi est quidem magnam volupt...
1,1,2,quo vero reiciendis velit similique earum,Jayne_Kuhic@sydney.com,est natus enim nihil est dolore omnis voluptat...
2,1,3,odio adipisci rerum aut animi,Nikita@garfield.biz,quia molestiae reprehenderit quasi aspernatur\...
3,1,4,alias odio sit,Lew@alysha.tv,non et atque\noccaecati deserunt quas accusant...
4,1,5,vero eaque aliquid doloribus et culpa,Hayden@althea.biz,harum non quasi et ratione\ntempore iure ex vo...

### Get data from SQL server

In [13]:
import pyodbc
'''
Connecting to a sql based DB is a 3 step process using pyodbc -
1) Create connection string. You can get the connection string sample from the link https://www.connectionstrings.com/
2) Connect To data base.
3) Create a cursor to make queries
NOTE: use COMMIT if you are changing any data and make sure to CLOSE cursor and connection.
This can be use to connect AZURE SQL Database, MS SQL Server, MySQL, MS Access etc
'''

# Create connection string
conn_str = ("Driver={ODBC Driver 17 for SQL Server};"
            "Server=LAPTOP-9EI2AHBP;"
            "Database=MyTestDB;"
            "UID=QATUser;"
            "PWD=p@s$word!123")

# Connect To database.
conn = pyodbc.connect(cnxn_str)
#Create a cursor
cursor = conn.cursor()
query = ("SELECT TOP(100) * FROM Candidates")
############### SQl Operations ###################
'''
cursor.execute(query)
sqlData = cursor.fetchall() # fetches all data, you can use fetchone for single record
print(sqlData)
'''
##################################

################ Reading to pandas ##################
# Panda uses sqlalchemy engine
from sqlalchemy import create_engine, event
from sqlalchemy.engine.url import URL

conn_url = URL.create("mssql+pyodbc", query={"odbc_connect": conn_str})
engine = create_engine(conn_url)

sqlDf = pd.read_sql(query, engine)
sqlDf
##################################
cursor.close()
conn.close()

In [25]:
sqlDf

   id  FirstName     LastName
0   1  Raj kumar        singh
1   2       Atul  Vishwakarma

### Get Data from Azure cloud

   id  FirstName     LastName
0   1  Raj kumar        singh
1   2       Atul  Vishwakarma